#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_vpc.vpc: Reading...
data.aws_iam_role.labrole: Reading...
data.aws_iam_role.labrole: Read complete after 0s [id=LabRole]
data.aws_vpc.vpc: Read complete after 0s [id=vpc-055557575bcb498e7]
data.aws_subnets.subnets: Reading...
aws_security_group.sg: Refreshing state... [id=sg-07ec03d931c392943]
data.aws_subnets.subnets: Read complete after 0s [id=us-east-1]
data.aws_subnet.subnet["subnet-0eadffb70e2d1e565"]: Reading...
data.aws_subnet.subnet["subnet-070894f1967527a98"]: Reading...
data.aws_subnet.subnet["subnet-0e476ff8557a8c893"]: Reading...
data.aws_subnet.subnet["subnet-06238683b1db68be5"]: Reading...
data.aws_subnet.subnet["subnet-037ebaeafdcc11430"]: Reading...
data.aws_subnet.subnet["subnet-013512bf3936fb64a"]: Reading...
data.aws_subnet.subnet["subnet-0e476ff8557a8c893"]: Read complete after 0s [id=subnet-0e476ff8557a8c893]
data.aws_subnet.subnet["subnet-06238683b1db68be5"]: Read complete after 1s [id=subnet-06238683b1db68be5]
data.aws_subnet.subnet["subnet-0eadffb70e2d1e565"]: Read complete after 1s [id=subnet-0eadffb70e2d1e565]
data.aws_subnet.subnet["subnet-070894f1967527a98"]: Read complete after 1s [id=subnet-070894f1967527a98]
data.aws_subnet.subnet["subnet-037ebaeafdcc11430"]: Read complete after 1s [id=subnet-037ebaeafdcc11430]
data.aws_subnet.subnet["subnet-013512bf3936fb64a"]: Read complete after 1s [id=subnet-013512bf3936fb64a]
aws_eks_cluster.eks-cluster: Refreshing state... [id=tech-challenge-lanchonete]
aws_eks_access_entry.access-entry: Refreshing state... [id=tech-challenge-lanchonete:arn:aws:iam::590183731131:role/voclabs]
aws_eks_access_policy_association.eks-policy: Refreshing state... [id=tech-challenge-lanchonete#arn:aws:iam::590183731131:role/voclabs#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
aws_eks_node_group.node-group: Refreshing state... [id=tech-challenge-lanchonete:NG-tech-challenge-lanchonete]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eks_access_entry.access-entry must be replaced
-/+ resource "aws_eks_access_entry" "access-entry" {
      ~ access_entry_arn  = "arn:aws:eks:us-east-1:590183731131:access-entry/tech-challenge-lanchonete/role/590183731131/voclabs/9ac9d461-fb46-779a-0aed-bf8d28355741" -> (known after apply)
      ~ created_at        = "2024-12-09T00:13:55Z" -> (known after apply)
      ~ id                = "tech-challenge-lanchonete:arn:aws:iam::590183731131:role/voclabs" -> (known after apply)
      ~ modified_at       = "2024-12-09T00:13:55Z" -> (known after apply)
      ~ principal_arn     = "arn:aws:iam::590183731131:role/voclabs" -> "arn:aws:iam:::role/voclabs" # forces replacement
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
      ~ user_name         = "arn:aws:sts::590183731131:assumed-role/voclabs/{{SessionName}}" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_eks_access_policy_association.eks-policy must be replaced
-/+ resource "aws_eks_access_policy_association" "eks-policy" {
      ~ associated_at = "2024-12-09 00:13:55.37 +0000 UTC" -> (known after apply)
      ~ id            = "tech-challenge-lanchonete#arn:aws:iam::590183731131:role/voclabs#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy" -> (known after apply)
      ~ modified_at   = "2024-12-09 00:13:55.37 +0000 UTC" -> (known after apply)
      ~ principal_arn = "arn:aws:iam::590183731131:role/voclabs" -> "arn:aws:iam:::role/voclabs" # forces replacement
        # (2 unchanged attributes hidden)

      ~ access_scope {
          - namespaces = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # aws_s3_bucket.backend will be created
  + resource "aws_s3_bucket" "backend" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "tcl-terraform-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 3 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @vitorrafael, Action: `pull_request`*